app/views/lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = 1
---
<ol>
<% @list.items.each do |item| %>