app/controllers/items_controller.rb

	def create
		@list = List.find(params[:list_id])
		@item = @list.items.build(params[:item])
		if @item.save
			@list.update_attribute(:updated_at,Time.now)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "items" ("created_at", "list_id", "status", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 23 Dec 2012 15:22:59 UTC +00:00], ["list_id", 1], ["status", nil], ["title", "Go to the show"], ["updated_at", Sun, 23 Dec 2012 15:22:59 UTC +00:00], ["url", nil]]
UPDATE "lists" SET "updated_at" = '2012-12-27 21:53:36.519621' WHERE "lists"."id" = 1

	def update
		@list = List.find(params[:list_id])
		@item = @list.items.find(params[:id])
		if @item.update_attributes(params[:item])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = 2 AND "items"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "items" SET "status" = 'checked', "updated_at" = '2012-12-23 15:50:39.210654' WHERE "items"."id" = 4
UPDATE "lists" SET "updated_at" = '2012-12-27 21:54:40.238106' WHERE "lists"."id" = 1