app/controllers/lists_controller.rb

	def index
		@lists = List.order("created_at DESC")
---
SELECT "lists".* FROM "lists" ORDER BY created_at DESC

	def create
		@list = List.new(params[:list])
		if @list.save
---
INSERT INTO "lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 23 Dec 2012 15:01:56 UTC +00:00], ["title", "New Haven"], ["updated_at", Sun, 23 Dec 2012 15:01:56 UTC +00:00]]