app/controllers/lists_controller.rb

	def index
		@lists = List.order("updated_at DESC")
---
SELECT "lists".* FROM "lists" ORDER BY updated_at DESC